In [3]:
import numpy as np
import pandas as pd

In [17]:
df = pd.read_excel("land - price.xlsx", sheet_name = "Sheet7")

In [18]:
df.head()

  town  area   price
0    m  2600  550000
1    m  3000  565000
2    m  3200  610000
3    m  3600  680000
4    m  4000  725000

In [19]:
dummies = pd.get_dummies(df.town)

In [20]:
df = pd.concat([df,dummies], axis = "columns")

In [21]:
df.head()

  town  area   price  m  r  w
0    m  2600  550000  1  0  0
1    m  3000  565000  1  0  0
2    m  3200  610000  1  0  0
3    m  3600  680000  1  0  0
4    m  4000  725000  1  0  0

In [23]:
df_final = df.drop(["town", "w"], axis = "columns")

In [24]:
df_final

    area   price  m  r
0   2600  550000  1  0
1   3000  565000  1  0
2   3200  610000  1  0
3   3600  680000  1  0
4   4000  725000  1  0
5   2600  585000  0  0
6   2800  615000  0  0
7   3300  650000  0  0
8   3600  710000  0  0
9   2600  575000  0  1
10  2900  600000  0  1
11  3100  620000  0  1
12  3600  695000  0  1

In [26]:
from sklearn import linear_model

In [31]:
reg = linear_model.LinearRegression()
reg.fit(df_final[["area", "m", "r"]], df_final.price)

LinearRegression()

In [33]:
reg.coef_

array([   126.89744141, -40013.97548914, -14327.56396474])

In [35]:
reg.predict([[2800, 0,1]])

array([590775.63964739])

In [36]:
reg.score(df_final[["area", "m", "r"]],df_final.price)

0.9573929037221873